In [13]:
import pandas as pd
import numpy as np

In [10]:
ser = pd.Series([9,8,7], index= ['a','b','c'])
ser

a    9
b    8
c    7
dtype: int64

In [11]:
ser['a']

9

In [15]:
s2data = np.arange(5)
s2 = pd.Series(s2data)
s2

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [22]:
dic = {'a' : 1,
       'b' : 2}
s3 = pd.Series(dic)
s3

a    1
b    2
dtype: int64

In [49]:
df = pd.DataFrame(data= np.arange(100).reshape(10,10), index=range(1,11))
df

     0   1   2   3   4   5   6   7   8   9
1    0   1   2   3   4   5   6   7   8   9
2   10  11  12  13  14  15  16  17  18  19
3   20  21  22  23  24  25  26  27  28  29
4   30  31  32  33  34  35  36  37  38  39
5   40  41  42  43  44  45  46  47  48  49
6   50  51  52  53  54  55  56  57  58  59
7   60  61  62  63  64  65  66  67  68  69
8   70  71  72  73  74  75  76  77  78  79
9   80  81  82  83  84  85  86  87  88  89
10  90  91  92  93  94  95  96  97  98  99

In [54]:
df

     0   1   2   3   4   5   6   7   8   9
1    0   1   2   3   4   5   6   7   8   9
2   10  11  12  13  14  15  16  17  18  19
3   20  21  22  23  24  25  26  27  28  29
4   30  31  32  33  34  35  36  37  38  39
5   40  41  42  43  44  45  46  47  48  49
6   50  51  52  53  54  55  56  57  58  59
7   60  61  62  63  64  65  66  67  68  69
8   70  71  72  73  74  75  76  77  78  79
9   80  81  82  83  84  85  86  87  88  89
10  90  91  92  93  94  95  96  97  98  99

In [63]:
df = pd.DataFrame({
       'col 1' : 5.0,
       'col 2' : [2,3,4,5],
       'col 3' : 'ah',
       'col 4' : np.array([4,6,7,8]),
       'col 5' : pd.Series([1]*4, index=['a', 'b', 'c','d']),
}, index=['a', 'b', 'c','d'])

In [65]:
df

   col 1  col 2 col 3  col 4  col 5
a    5.0      2    ah      4      1
b    5.0      3    ah      6      1
c    5.0      4    ah      7      1
d    5.0      5    ah      8      1

In [92]:
dataframe = pd.DataFrame(data= np.arange(10000).reshape(1000,10), columns=['col1','col2','col3','col4','col5','col6','col7','col8','col9','col10'])

In [93]:
dataframe

     col1  col2  col3  col4  col5  col6  col7  col8  col9  col10
0       0     1     2     3     4     5     6     7     8      9
1      10    11    12    13    14    15    16    17    18     19
2      20    21    22    23    24    25    26    27    28     29
3      30    31    32    33    34    35    36    37    38     39
4      40    41    42    43    44    45    46    47    48     49
..    ...   ...   ...   ...   ...   ...   ...   ...   ...    ...
995  9950  9951  9952  9953  9954  9955  9956  9957  9958   9959
996  9960  9961  9962  9963  9964  9965  9966  9967  9968   9969
997  9970  9971  9972  9973  9974  9975  9976  9977  9978   9979
998  9980  9981  9982  9983  9984  9985  9986  9987  9988   9989
999  9990  9991  9992  9993  9994  9995  9996  9997  9998   9999

[1000 rows x 10 columns]

In [95]:
dataframe.iloc[50,1:8]

col2    501
col3    502
col4    503
col5    504
col6    505
col7    506
col8    507
Name: 50, dtype: int32

In [102]:
dataset = pd.read_csv('data/AB_NYC_2019.csv')

In [103]:
dataset

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,NaN,1,23

In [98]:
dataset.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,4.889500e+04,4.889500e+04,48895.000000,48895.000000,48895.000000,48895.000000,48895.000000,38843.000000,48895.000000,48895.000000
mean,1.901714e+07,6.762001e+07,40.728949,-73.952170,152.720687,7.029962,23.274466,1.373221,7.143982,112.781327
std,1.098311e+07,7.861097e+07,0.054530,0.046157,240.154170,20.510550,44.550582,1.680442,32.952519,131.622289
min,2.539000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.471945e+06,7.822033e+06,40.690100,-73.983070,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.967728e+07,3.079382e+07,40.723070,-73.955680,106.000000,3.000000,5.000000,0.720000,1.000000,45.000000
75%,2.915218e+07,1.074344e+08,40.763115,-73.936275,175.000000,5.000000,24.000000,2.020000,2.000000,227.000000
max,3.648724e+07,2.743213e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [100]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48895 entries, 0 to 48894
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              48895 non-null  int64
 1   name                            48879 non-null  object
 2   host_id                         48895 non-null  int64
 3   host_name                       48874 non-null  object
 4   neighbourhood_group             48895 non-null  object
 5   neighbourhood                   48895 non-null  object
 6   latitude                        48895 non-null  float64
 7   longitude                       48895 non-null  float64
 8   room_type                       48895 non-null  object
 9   price                           48895 non-null  int64
 10  minimum_nights                  48895 non-null  int64
 11  number_of_reviews               48895 non-null  int64
 12  last_review                     38843 non-null  object
 13  reviews_per_month               38843 non-null  float64
 14  calculated_host_listings_count  48895 non-null  int64
 15  availability_365                48895 non-null  int64
dtypes: float64(3), int64(7), object(6)
memory usage: 6.0+ MB

In [101]:
dataset.isna().sum()

id                                    0
name                                 16
host_id                               0
host_name                            21
neighbourhood_group                   0
neighbourhood                         0
latitude                              0
longitude                             0
room_type                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
last_review                       10052
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64